# Устанавливаем компилятор
CXX = g++

# Определяем флаги компиляции
CXXFLAGS = -Wall -g -std=c++17

# Имя исполнимого файла
TARGET = chess

# Исходный файл
SRCS = chess.cpp

# Объектные файлы
OBJS = $(SRCS:.cpp=.o)

# Цель по умолчанию
all: $(TARGET)

# Правило для компиляции исполнимого файла
$(TARGET): $(OBJS)
	$(CXX) $(CXXFLAGS) -o $(TARGET) $(OBJS)

# Правило для компиляции исходного файла в объектный файл
%.o: %.cpp
	$(CXX) $(CXXFLAGS) -c $<

# Правило для очистки сгенерированных файлов
clean:
	rm -f $(OBJS) $(TARGET)
